#include <iostream>
using namespace std;

int main(int argc, char** argv) {
	setlocale(LC_ALL, "Turkish");

	int sonuc;
	
	// Sayý1: 00000000000000000000000000000101 (5)
	// Sayý2: 00000000000000000000000000000011 (3)
	// Sonuç: 00000000000000000000000000000001 (1)
	sonuc = 5 & 3;
	cout << sonuc << endl; // 1
	
	// Sayý1: 00000000000000000000000000001010 (10)
	// Sayý2: 00000000000000000000000000000111 (7)
	// Sonuç: 00000000000000000000000000000010 (2)
	sonuc = 10 & 7;
	cout << sonuc << endl; // 2
	
	// Sayý1: 00000000000000000000000000001111 (15)
	// Sayý2: 00000000000000000000000000000111 (7)
	// Sonuç: 00000000000000000000000000000111 (7)
	sonuc = 15 & 7;
	cout << sonuc << endl; // 7
	
	return 0;
}

