#include <iostream>
using namespace std;

int main(int argc, char** argv) {
	setlocale(LC_ALL, "Turkish");

	int sonuc;
	
	// Sayý1: 00000000000000000000000000000101 (5)
	// Sayý2: 00000000000000000000000000000011 (3)
	// Sonuç: 00000000000000000000000000000111 (7)
	sonuc = 5 | 3;
	cout << sonuc << endl; // 7
	
	// Sayý1: 00000000000000000000000000001010 (10)
	// Sayý2: 00000000000000000000000000000110 (6)
	// Sonuç: 00000000000000000000000000001110 (14)
	sonuc = 10 | 6;
	cout << sonuc << endl; // 14
	
	// Sayý1: 00000000000000000000000000001111 (15)
	// Sayý2: 00000000000000000000000000000110 (6)
	// Sonuç: 00000000000000000000000000001111 (15)
	sonuc = 15 | 6;
	cout << sonuc << endl; // 15
	
	return 0;
}

